announcements/tables-are-more-than-screen-deep.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-02 Mon 09:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Web: Data Tables Can Be More Than Screen-Deep</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Web: Data Tables Can Be More Than Screen-Deep</h1>
<div id="outline-container-org10d3109" class="outline-2">
<h2 id="org10d3109"><span class="section-number-2">1</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
A few years ago, layout tables made speaking Web content difficult;
that phase has now morphed into an even more horrifying soup of <code>div</code>
and <code>span</code> tags styled by CSS. This also means that now, if you
encounter a <code>table</code> element, it likely contains some useful data;
also, deeply nested tables are beginning to feel like a thing of the
past.
</p>

<p>
Sadly, this has not made getting data out of HTML tables any easier, a
combination of badly created markup, many redundant DOM nodes that
appear to exist purely for enabling DOM scripting, and  heavy-weight
DOM structures that are the result of code-generation  
have mostly created a different, but equally horrifying situation.
</p>

<p>
One of the primary reasons to do everything in a rich end-user
environment like Emacs is the ability to share data across tasks and
being able to manipulate data as <i>data</i>, rather than working with that
data's underlying visual representation. Emacs can now render Web
documents that are content focused, so the next immediate desire is to
be able to extract data in a useful form from EWW rendered pages. This
article describes one simple approach that lets me turn HTML tables
found in the wild into a coherent tabular data structure  that I can
then render meaningfully via emacspeak to obtain multiple <i>views</i> of
the data.
</p>
</div>
</div>

<div id="outline-container-org0ca0043" class="outline-2">
<h2 id="org0ca0043"><span class="section-number-2">2</span> Initial Approach That Failed</h2>
<div class="outline-text-2" id="text-2">
<p>
I first tried to see if I could make EWW annotate the rendered <i>table
data</i>
with text properties &#x2014; sadly that proved impossible to do in the
current implementation. Note however that Emacspeak does use text
properties to provide access to other aspects of HTML document
structure such as section headers.
</p>
</div>
</div>

<div id="outline-container-org0d62bb7" class="outline-2">
<h2 id="org0d62bb7"><span class="section-number-2">3</span> Ensuring That EWW Rendered Tables Are More than Screen-Deep</h2>
<div class="outline-text-2" id="text-3">
<p>
I implemented the approach described below a couple of weeks ago and
it appears to work well barring a few known limitations.
</p>

<ol class="org-ol">
<li>I  <i>adviced</i> EWW to store a pointer to the <i>Table DOM</i> in the EWW buffer.</li>
<li>I defined a function that converts the DOM nodes from the
<i>table-dom</i> into a two-dimensional vector.</li>
<li>I then pass this structure to Emacspeak's <i>Table-UI</i> module to
obtain a browsable two-dimensional structure.</li>
<li>Module <i>emacspeak-table-ui</i> enables the user to obtain multiple
<i>spoken views</i>  of the  tabular data.</li>
</ol>

<p>
See the following sections for details on each of these steps.
</p>
</div>

<div id="outline-container-org205907b" class="outline-3">
<h3 id="org205907b"><span class="section-number-3">3.1</span> Storing A Pointer To The Table-DOM</h3>
<div class="outline-text-3" id="text-3-1">
<p>
#+b egin<sub>src</sub>  emacs-lisp 
(defadvice shr-tag-table-1 (around emacspeak pre act comp) 
  "Cache pointer to table dom as a text property"
  (let ((table-dom (ad-get-arg 0))
        (start (point)))
    ad-do-it
    (unless (get-text-property start 'table-dom)
      (put-text-property start (point)
                         'table-dom table-dom))
    ad-return-value))
#+end<sub>src</sub>
</p>

<p>
This advice stores a pointer to the <i>DOM</i> of the table being rendered
over the region  containing the rendering.
</p>
</div>
</div>

<div id="outline-container-org06b659a" class="outline-3">
<h3 id="org06b659a"><span class="section-number-3">3.2</span> Generate A Tabular Structure From The Dom</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Function <code>emacspeak-eww-table-table</code> generates a two-dimensional
vector that encaspulates the tabular data.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">emacspeak-eww-table-table</span> ()
  <span style="color: #c6eaff;">"Return table cells as a table, a 2d structure."</span>
  (<span style="color: #b6a0ff;">let*</span> ((data nil)
         (table (get-text-property (point) 'table-dom))
         (head (dom-by-tag table 'th)))
    (<span style="color: #dbbe5f;">cl-assert</span> table t <span style="color: #79a8ff;">"No table here."</span>)
    (<span style="color: #b6a0ff;">setq</span> data
          (<span style="color: #b6a0ff;">cl-loop</span>
           for r in (dom-by-tag table 'tr) collect
           (<span style="color: #b6a0ff;">cl-loop</span>
            for c in
            (append
             (dom-by-tag r 'th)
             (dom-by-tag r 'td))
            collect
            (string-trim (dom-node-as-text c)))))
    <span style="color: #a8a8a8;">;;; </span><span style="color: #a8a8a8;">handle head case differently:</span>
    (<span style="color: #b6a0ff;">if</span> head
        (apply #'vector (mapcar #'vconcat  (cdr data)))
      (apply #'vector (mapcar #'vconcat  data)))))
</pre>
</div>


<p>
The above code handles the case where there are header (i.e., <span class="underline">th</span>)
cells specially to avoid a bug where we get two copies of the data.
The nested loops  generates a list of lists, and the final call
turns this into a two-dimensional vector.
</p>
</div>
</div>

<div id="outline-container-orgee97ff4" class="outline-3">
<h3 id="orgee97ff4"><span class="section-number-3">3.3</span> Browsing Tables As Data</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Interactive command <code>emacspeak-eww-table-data</code> (bound to <span class="underline">C-t</span>) takes the <i>table</i> at
point, i.e. when point is anywhere within a table rendering, and
creates a browsable table buffer as implemented by module 
<a href="https://github.com/tvraman/emacspeak/blob/master/lisp/emacspeak-table-ui.el#L483">emacspeak-table-ui</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b6a0ff;">defun</span> <span style="color: #feacd0;">emacspeak-eww-table-data</span> ()
  <span style="color: #c6eaff;">"View  table at point as a data table using Emacspeak Table UI."</span>
  (<span style="color: #b6a0ff;">interactive</span>)
  (<span style="color: #b6a0ff;">let</span> ((data (emacspeak-eww-table-table))
        (data-table nil)
        (inhibit-read-only  t)
        (buffer
         (get-buffer-create
          (format  <span style="color: #79a8ff;">"Table: %s"</span> (emacspeak-eww-current-title)))))
    (<span style="color: #b6a0ff;">setq</span> data-table (emacspeak-table-make-table data))
      (emacspeak-table-prepare-table-buffer data-table buffer)))
</pre>
</div>

<p>
The two-dimensional vector described earlier is now converted to a
tabular structure as expected  by module <code>emacspeak-table-ui</code>, the
primary difference being that this structure explicitly captures row
and column headers.
</p>
</div>
</div>

<div id="outline-container-org0c8029a" class="outline-3">
<h3 id="org0c8029a"><span class="section-number-3">3.4</span> Browsing The Tabular Data</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Emacspeak's <a href="https://tvraman.github.io/emacspeak/manual/emacspeak_002dtable.html#emacspeak_002dtable">Table UI</a> allows one to:
</p>

<ol class="org-ol">
<li>Move through table cells, either by row or column.</li>
<li>Determine what is spoken  during such navigation,</li>
<li>Spoken views can include cell value, row header and column header.</li>
<li>For more advanced use-cases, one can define a <i>row filter</i> or
<i>column filter</i>, think of these as specialized <i>formatters</i> that
can format  selected cells and their headers into a
natural-sounding sentence.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-11-02 Mon 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2020-11-02 Mon 09:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
